#### BuiltInFailures.TagFailures Members

---

|  |
| --- |
| BuiltInFailures TagFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures TagFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCopyTag | A tag cannot be arrayed without copying the associated element. |
| Public property Static member | CannotCopyTagWarn | A tag cannot be arrayed without copying the associated element. |
| Public property Static member | CannotPasteOrphanTags | Orphaned tags cannot be pasted. |
| Public property Static member | CannotPasteOrphanTagsWarn | Orphaned tags cannot be pasted. |
| Public property Static member | CannotPasteTag | Can't find new element to tag. Tag won't be copied. |
| Public property Static member | CannotRemapTagReference | The tag reference was not remapped. |
| Public property Static member | ElementCategoryChangeInvalidatesTag | Elements have changed category. Tags for these elements are now of the wrong category and will be deleted. |
| Public property Static member | ElementCategoryChangeInvalidatesTagUpgrade | During upgrade, Revit discovered that the highlighted elements were marked with tags of the wrong category. These tags were deleted. |
| Public property Static member | MultiCategoryTagFilterParamNotFoundInElement | The filter specified by Multi-Category Tag can't be used with the tagged object. |
| Public property Static member | RemoveTagWithNoLeaders | The Tag was deleted because it was no longer pointing to any elements. |
| Public property Static member | TagsCannotBePlacedInUnlocked3dViews | Tags can't be pasted into Unlocked 3D views. |

# See Also

BuiltInFailures TagFailures Class

Autodesk.Revit.DB Namespace